#include <stdio.h>

// Строка. Создай массив из 32 символов. Прочитай строку через fgets и выведи её через %s. Проверь обычный текст и пустой Enter.

// Поиск символа. Определи через strchr, есть ли в прочитанной строке символ @.

int main(void) {
    char text[32];

    printf("write any word 32< symbols: ");

    fgets(text, sizeof(text), stdin);

    printf("%s", text);

    return 0;

}


// Преобразование. Прочитай строку, вызови strtod и выведи полученное число. Сравни ввод 12.5, abc, 12abc.
// Остаток строки. Для тех же примеров выясни, на какой символ указывает end.


